jmeter/results/run-report/statistics.json
{
  "GET Health" : {
    "transaction" : "GET Health",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 5023.0,
    "medianResTime" : 5023.0,
    "minResTime" : 5023.0,
    "maxResTime" : 5023.0,
    "pct1ResTime" : 5023.0,
    "pct2ResTime" : 5023.0,
    "pct3ResTime" : 5023.0,
    "throughput" : 0.19908421262193907,
    "receivedKBytesPerSec" : 0.5414546212422855,
    "sentKBytesPerSec" : 0.0
  },
  "TX Smoke API" : {
    "transaction" : "TX Smoke API",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 10144.0,
    "medianResTime" : 10144.0,
    "minResTime" : 10144.0,
    "maxResTime" : 10144.0,
    "pct1ResTime" : 10144.0,
    "pct2ResTime" : 10144.0,
    "pct3ResTime" : 10144.0,
    "throughput" : 0.09858044164037855,
    "receivedKBytesPerSec" : 0.5362236913446372,
    "sentKBytesPerSec" : 0.0
  },
  "Estres GET Health" : {
    "transaction" : "Estres GET Health",
    "sampleCount" : 400,
    "errorCount" : 13,
    "errorPct" : 3.25,
    "meanResTime" : 245.0125000000001,
    "medianResTime" : 61.0,
    "minResTime" : 24.0,
    "maxResTime" : 5023.0,
    "pct1ResTime" : 162.0,
    "pct2ResTime" : 452.09999999999957,
    "pct3ResTime" : 5004.0,
    "throughput" : 5.0360708575169655,
    "receivedKBytesPerSec" : 2.452268966314981,
    "sentKBytesPerSec" : 0.9085952155753081
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 702,
    "errorCount" : 20,
    "errorPct" : 2.8490028,
    "meanResTime" : 240.37606837606828,
    "medianResTime" : 70.5,
    "minResTime" : 24.0,
    "maxResTime" : 5023.0,
    "pct1ResTime" : 156.0,
    "pct2ResTime" : 359.9000000000008,
    "pct3ResTime" : 5004.0,
    "throughput" : 8.838304354942274,
    "receivedKBytesPerSec" : 4.437361212969141,
    "sentKBytesPerSec" : 1.5964320028139045
  },
  "Carga GET Empresas" : {
    "transaction" : "Carga GET Empresas",
    "sampleCount" : 300,
    "errorCount" : 5,
    "errorPct" : 1.6666666,
    "meanResTime" : 202.37333333333316,
    "medianResTime" : 79.0,
    "minResTime" : 48.0,
    "maxResTime" : 5004.0,
    "pct1ResTime" : 142.0,
    "pct2ResTime" : 181.0,
    "pct3ResTime" : 5002.0,
    "throughput" : 4.929508035098097,
    "receivedKBytesPerSec" : 2.501404396299583,
    "sentKBytesPerSec" : 0.8977096273291926
  },
  "GET Empresas" : {
    "transaction" : "GET Empresas",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 5004.0,
    "medianResTime" : 5004.0,
    "minResTime" : 5004.0,
    "maxResTime" : 5004.0,
    "pct1ResTime" : 5004.0,
    "pct2ResTime" : 5004.0,
    "pct3ResTime" : 5004.0,
    "throughput" : 0.19984012789768185,
    "receivedKBytesPerSec" : 0.5435105040967226,
    "sentKBytesPerSec" : 0.0
  }
}